{
  "blogs": [
    {
      "title": "FATHER'S DAY",
      "sample": "\"Any man can be a father but it takes someone special to be a Dad.\" How true is that statement, isn't it? The world has never been an easy place for any of us but there they are — already watching us over and leading us by their hands over ours. They make each step of our journeys worthwhile.",
      "highlight": "\"Any man can be a father but it takes someone special to be a Dad.\"",
      "body": [
          "How true is that statement, isn't it? The world has never been an easy place for any of us but there they are — already watching us over and leading us by their hands over ours. They make each step of our journeys worthwhile. They had always been the epitome of sacrifice. They had always been on the watch — ever providing with a heart like no other. Remember how many times we would have been knocked by the harsh blows and our heart echoes they go through, do they? They lock all their pains away and continue their battles in silence so that we don’t have a hungover consciousness in us. Oftentimes, all we offer them is incessant rudeness. Oftentimes and why? I suppose we have our elements of eccentricity. We think we go through things that none had gone through forgetting that they too have crossed such stages. Don’t you think the world already has got us by our throat? I feel that most of the time. What is your escapism from it? Many forgo their pains by letting the bottled-up emotions to their friends who might not be available many times. But I think the most beautiful thing is an open relationship with our fathers where we can share everything we go through and they are there listening without a pail of judgment and giving us the words we need the most. Not all are blessed with this openness yet I think that only garnishes a beautiful relationship. We spend so much of our time on volatile people and bonds that rarely lasts. So why not give all of our time and energy to stabilizing a relationship that is more important than anything else? I think it is worth it in the end. The relationship between father and his child. An oath that no matter what I will always be there in times of trials and happiness, in times of pain and prosperity and riding through everything, everything. So, on this beautiful day, we ask you to develop a deep-rooted bond with the person who means only glad tidings on your way. The one who wishes only the best of everything for you, you owe a lot to the person. Open up your heart and speak to him Say what he means to you and how grateful you are to possess something that is beyond measure. Create joyful memories as in how you would wish to do with your friends. Make him your friend and be there for him like how you had always been to others. Give him your time for that is all he wishes. Treat him right. Treasure him and fill his heart with bliss. Enough of the plentitude of sacrifices he has made. Do something from your side. Make each moment count. With that said — we Poshe Mode as a team with every person out there a Happy Father’s Day. We are glad that you have raised your kids with such charm and poise and they are already there making this world a bright place to live in. Live long and may your hearts be filled with every speck of joy in the world. Have a happy life ahead."
      ]
    }
  ]
}
